[
  {
    "path": "posts/welcome/",
    "title": "Welcome to My Blog",
    "description": "Welcome to our new blog, My Blog. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-06-07",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-07T20:59:05+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-06-07-project-proposal/",
    "title": "ISSS608 G1 Group 5 - Project Proposal",
    "description": "Vast Challenge 2021 Mini-Challenge 2 - with R",
    "author": [
      {
        "name": "Chen Yuxi, Jovinka Hartanto, Lim Yong Kai",
        "url": {}
      }
    ],
    "date": "2021-06-07",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Overview\r\n2. Objectives\r\n3. Previous Work and GIS Application\r\n4. Data Sources\r\n5. Methodology and Analytical Approach\r\n6. Assumptions\r\n7. Application DesignData Visualisation\r\nApplication Interface\r\n\r\n\r\n1. Overview\r\nIn the roughly twenty years that Tethys-based GAStech has been operating a natural gas production site in the island country of Kronos, it has produced remarkable profits and developed strong relationships with the government of Kronos. However, GAStech has not been as successful in demonstrating environmental stewardship.\r\nIn January, 2014, the leaders of GAStech are celebrating their new-found fortune as a result of the initial public offering of their very successful company. In the midst of this celebration, several employees of GAStech go missing. An organization known as the Protectors of Kronos (POK) is suspected in the disappearance, but things may not be what they seem.\r\n2. Objectives\r\nBoth historical vehicle tracking data and transaction data from loyalty and credit card will be used to observe the following issues:\r\nThe most popular locations and when they are popular\r\nInfer the owner of each credit card and loyalty card\r\nIdentify potential informal or unofficial relationships among GASTech personnel\r\nAnalyze unusual and suspicious activities of the employees\r\nAnalyze daily routines of GasTech employees\r\n3. Previous Work and GIS Application\r\nGeographic information system (GIS) data has been used by different business and entities for many purposes. Police agencies are using Geographic Information Systems (GIS) for mapping crime, identifying crime “hot spots,” assigning officers, and profiling offenders.\r\nAccording to a 2001 survey by the National Institute of Justice, 62 percent of police departments with over 100 officers use GIS systems. Collectively, the technology has been credited with reducing crime, decreasing residential burglaries, tracking parolees and serious habitual offenders, and identifying “hot spots” with high concentrations of crime.\r\nIs the Use of Geographic Information Systems (GIS) for Policing Effective?, 2014\r\n4. Data Sources\r\nThe data source are available publicly on VAST Challenge 2021 website under the sub section Mini-Challenge 2. The data used for the project are as follows:\r\n\r\n\r\n\r\nGeospatial maps of Abila and Kronos Island\r\n\r\n\r\n\r\nFigure 1: Map of Abila, Kronos\r\n\r\n\r\n\r\n54 employees details of GAStech\r\n\r\nLastName\r\nFirstName\r\nBirthDate\r\nBirthCountry\r\nGender\r\nBramar\r\nMat\r\n1981-12-19\r\nTethys\r\nMale\r\nRibera\r\nAnda\r\n1975-11-17\r\nTethys\r\nFemale\r\nPantanal\r\nRachel\r\n1984-08-22\r\nTethys\r\nFemale\r\nLagos\r\nLinda\r\n1980-01-26\r\nTethys\r\nFemale\r\nMies Haber\r\nRuscella\r\n1964-04-26\r\nKronos\r\nFemale\r\nForluniau\r\nCarla\r\n1981-06-02\r\nKronos\r\nFemale\r\n\r\n44 employees car assignments\r\n\r\nLastName\r\nFirstName\r\nCarID\r\nCurrentEmploymentType\r\nCurrentEmploymentTitle\r\nCalixto\r\nNils\r\n1\r\nInformation Technology\r\nIT Helpdesk\r\nAzada\r\nLars\r\n2\r\nEngineering\r\nEngineer\r\nBalas\r\nFelix\r\n3\r\nEngineering\r\nEngineer\r\nBarranco\r\nIngrid\r\n4\r\nExecutive\r\nSVP/CFO\r\nBaza\r\nIsak\r\n5\r\nInformation Technology\r\nIT Technician\r\nBergen\r\nLinnea\r\n6\r\nInformation Technology\r\nIT Group Manager\r\n\r\n1,490 credit card transactions for 55 unique credit card numbers\r\n\r\ntimestamp\r\nlocation\r\nprice\r\nlast4ccnum\r\n01/06/2014 07:28\r\nBrew’ve Been Served\r\n11.34\r\n4795\r\n01/06/2014 07:34\r\nHallowed Grounds\r\n52.22\r\n7108\r\n01/06/2014 07:35\r\nBrew’ve Been Served\r\n8.33\r\n6816\r\n01/06/2014 07:36\r\nHallowed Grounds\r\n16.72\r\n9617\r\n01/06/2014 07:37\r\nBrew’ve Been Served\r\n4.24\r\n7384\r\n01/06/2014 07:38\r\nBrew’ve Been Served\r\n4.17\r\n5368\r\n\r\n685,168 GPS log data from 6 Jan 2014 to 19 Jan 2014\r\n\r\nTimestamp\r\nid\r\nlat\r\nlong\r\n01/06/2014 06:28:01\r\n35\r\n36.07623\r\n24.87469\r\n01/06/2014 06:28:01\r\n35\r\n36.07622\r\n24.87460\r\n01/06/2014 06:28:03\r\n35\r\n36.07621\r\n24.87444\r\n01/06/2014 06:28:05\r\n35\r\n36.07622\r\n24.87425\r\n01/06/2014 06:28:06\r\n35\r\n36.07621\r\n24.87417\r\n01/06/2014 06:28:07\r\n35\r\n36.07619\r\n24.87406\r\n\r\n1,392 loyalty card transactions for 54 unique loyalty card numbers\r\n\r\ntimestamp\r\nlocation\r\nprice\r\nloyaltynum\r\n01/06/2014\r\nBrew’ve Been Served\r\n4.17\r\nL2247\r\n01/06/2014\r\nBrew’ve Been Served\r\n9.60\r\nL9406\r\n01/06/2014\r\nHallowed Grounds\r\n16.53\r\nL8328\r\n01/06/2014\r\nCoffee Shack\r\n11.51\r\nL6417\r\n01/06/2014\r\nHallowed Grounds\r\n12.93\r\nL1107\r\n01/06/2014\r\nBrew’ve Been Served\r\n4.27\r\nL4034\r\n\r\n5. Methodology and Analytical Approach\r\nOur group aims to provide users with an interactive to derive insights from the data source. RStudio is the main software tool that will be used for analysing and developing the project artefact and output. R packages, such as dplyr, reshape2, tidyr, lubridate and tmap will be used to perform data manipulation, data transformation and geospatial plots of map. In addition, GGplot2 and Shiny will be used to create visualisations for the app.\r\nThe analytical approach of this study are as follow:\r\nExploratory Data Analysis (EDA): to understand the patterns and the relationship between the GPS, car assignment, and transaction data. EDA will also performed to detect any missing data, outliers, and or anomalies that might exist in the dataset.\r\nExploratory Spatial Data Analysis (ESDA): to visualize and explore island map and GPS route and to determine the popularity for each location\r\nGeospatial and aspatial clustering: to determine unusual relationship between employees and suspicious activities occuring using GPS or transaction data\r\nR Markdown and R Shiny to prepare the report and user interface\r\nThe time frame for this project is shown below.\r\n\r\n\r\n\r\nFigure 2: Project Gantt Chart\r\n\r\n\r\n\r\n6. Assumptions\r\nThe main underlying assumption lies with the mapping of location details on the credit cards and loyalty cards data to the travel route of each vehicle. The data does not provide the GPS location in the credit and loyalty cards transaction data. Hence apart from assigning the various locations in the cards data with a GPS coordinate, a sorting of time stamps is also required to determine when the vehicles had become stationary. Where the vehicles stopped at is assumed to be where the employees have gone at that specific time period.\r\n7. Application Design\r\nData Visualisation\r\nCloropleth maps to identify popular location\r\nGeospatial maps to show the maps of Abila\r\nHistogram to show frequency of visit to specific locations based off GPS data\r\nParallel plot to show potential informal or unofficial relationships among GASTech personnel\r\nBoxplot for transaction data from credit card and loyalty card\r\nLine graph to show speed of the vehicles of the respective employee\r\nVisualize movement and temporal changes of the GPS tracking data by creating video animations\r\nApplication Interface\r\nThe Shiny App is envisioned to have these functionalities:\r\nAllow users to input the top n number of popular and suspicious location\r\nMultiple values (drop down) of employees to display moving line from GPS data on Abila map\r\nSlide bar for time and date inputs for cloropleth maps\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-06-07-project-proposal/img/timeline.png",
    "last_modified": "2021-06-19T16:37:37+08:00",
    "input_file": "project-proposal.knit.md"
  }
]
