[
  {
    "path": "posts/welcome/",
    "title": "Welcome to My Blog",
    "description": "Welcome to our new blog, My Blog. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-06-07",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-07T20:59:05+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-06-07-project-proposal/",
    "title": "Group 5 - Project Proposal",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Chen Yuxi, Jovinka Hartanto, Lim Yong Kai",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-06-07",
    "categories": [],
    "contents": "\r\n1. Overview\r\nIn the roughly twenty years that Tethys-based GAStech has been operating a natural gas production site in the island country of Kronos, it has produced remarkable profits and developed strong relationships with the government of Kronos. However, GAStech has not been as successful in demonstrating environmental stewardship.\r\nIn January, 2014, the leaders of GAStech are celebrating their new-found fortune as a result of the initial public offering of their very successful company. In the midst of this celebration, several employees of GAStech go missing. An organization known as the Protectors of Kronos (POK) is suspected in the disappearance, but things may not be what they seem.\r\n2. Objectives\r\nBoth historical vehicle tracking data and transaction data from loyalty and credit card will be used to observe the following issues:\r\nThe most popular locations and when they are popular\r\nInfer the owner of each credit card and loyalty card\r\nIdentify potential informal or unofficial relationships among GASTech personnel\r\nAnalyze suspicious activity of the missing personnel prior to the disappearance\r\n3. Past Related Work\r\n4. Data Sources\r\n5. Methodology and Analytical Approach\r\nOur group aims to provide users with an interactive to derive insights from the data source. R packages, such as dplyr, reshape2, and tidyr will be used to perform data manipulation and data transformation. In addition, GGplot2 and Shiny will be used to create visualisations for the app.\r\nThe analytical approach of this study are as follow:\r\nExploratory Data Analysis (EDA): to understand the patterns and th relationship between the GPS, car assignment, and transaction data. EDA will also performed to detect any missing data, outliers, and or anomalies that might exist in the dataset.\r\nExploratory Spatial Data Analysis (ESDA): to visualize and explore island map and GPS route and to determine the popularity for each location\r\nGeospatial and aspatial clustering: to determine unusual relationship between employees and suspicious activities occuring using GPS or transaction data\r\nR Markdown and R Shiny to prepare the report and user interface\r\n6. Application Design\r\nData Visualisation\r\nCloropleth maps to identify popular location prior to the disappearance\r\nApplication Interface\r\nThe Shiny App is envisioned to have these functionalities:\r\nAllow users to input the top n number of popular and suspicious location.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-15T23:22:29+08:00",
    "input_file": "project-proposal.knit.md"
  }
]
